Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/overview--postgis_overview.tmx
Source language: en
Languages: ja

source: Spatial Database
ja: 空間データベース

source: PostGIS spatially enables the popular PostgreSQL object-relational database, allowing it to be used as a back-end database for geographic information systems (GIS) and web-mapping applications.
ja: PostGIS は人気のある PostgreSQL オブジェクト-リレーショナルデータベースを空間対応したもので、地理情報システム (GIS) や Webマッピングアプリケーションのためのバックエンドデータベースとして利用可能です。

source: PostGIS is stable, fast, standards compliant, with hundreds of spatial functions and is currently the most widely used Open Source spatial database. PostGIS is used by diverse organisations from around the world, including risk-averse government agencies and organisations storing terabytes of data serving millions of web requests per day.
ja: PostGIS は安定して、高速で、標準に準拠した多くの機能を持ち、オープンソースの空間データベースの中では、現在、最も幅広く利用されています。PostGIS は世界中の様々な組織で利用されています。その中には危機対策政府機関やテラバイト級データを持ち毎日数百万回のリクエストを処理している機関もあります。

source: Database administration is available for desktop and the web via pgAdmin, phpPgAdmin, and others. Data import/export can be done by command line tools (shp2pgsql, pgsql2shp, ogr2ogr, dxf2postgis) or from desktop and web GIS clients. These clients can also map and manipulate PostGIS spatial data tables.
ja: データベース管理は、pgAdmin、phpPgAdmin、その他のプログラムを利用して可能です。データのインポート・エクスポートは、コマンドラインツール (shp2pgsql、pgsql2shp、ogr2ogr、dxf2postgis) や、デスクトップ、Web GIS クライアントから可能です。これらのクライアントは PostGIS 空間データテーブルの地図表示や操作を可能とします。

source: Core Features
ja: 主要機能

source: Hundreds of spatial functions
ja: 何百もの空間関数群

source: Buffers, unions, overlays, distance and more
ja: バッファ、ユニオン、オーバーレイ、ディスタンス など

source: ACID transactional integrity
ja: ACID トランザクションの完全性

source: R-Tree spatial index
ja: R-Tree 空間インデックス

source: Multi-user support
ja: マルチユーザのサポート

source: Row-level locking
ja: 行レベルのロッキング

source: Replication
ja: レプリケーション

source: Partitioning
ja: パーティショニング

source: Role-based security
ja: ロールベースのセキュリティ

source: Table-spaces, schemas
ja: テーブル空間、スキーマ

source: Implemented Standards
ja: 実装されている標準規格

source: OGC standards compliant (SFSQL)
ja: OGC 標準への準拠 (SFSQL)

source: Details
ja: 詳細

source: **Website:** http://postgis.net
ja: **Webサイト:** http://postgis.net

source: **Licence:** GNU General Public License (GPL) version 2
ja: **ライセンス:** GNU General Public License (GPL) version 2

source: **Software Version:** |version-postgis|
ja: **ソフトウェアバージョン:** |version-postgis|

source: **Supported Platforms:** Windows, Linux, Mac
ja: **対応プラットフォーム:** Windows, Linux, Mac

source: **API Interfaces:** SQL
ja: **API インターフェイス:** SQL

source: **Support:** |SUPPORT|
ja: **サポート:** |SUPPORT|

source: Quickstart
ja: クイックスタート

source: :doc:`Quickstart documentation <../quickstart/postgis_quickstart>`
ja: :doc:`クイックスタート文書 <../quickstart/postgis_quickstart>`
